# running in bitwise_task1/src/

read -formal bitwise.v
prep -top bitwise


hierarchy -smtcheck
write_jny -no-connections ../model/design.json
write_rtlil ../model/design.il
