# running in blocking_with_spi_task2/src/

read -formal blocking_with_spi_configured.v
prep -top blocking_with_spi_configured


hierarchy -smtcheck
write_jny -no-connections ../model/design.json
write_rtlil ../model/design.il
